Documents/ЗаданиеНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ЗаданиеНаПеревозку</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
	</Document>
</MetaDataObject>

Enums/РИНЭКО_СтатусыПорученияЭкспедитору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>РИНЭКО_СтатусыПорученияЭкспедитору</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВПроцессе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаданиеНаПеревозку/Ext/ManagerModule.bsl
// + [Rineco], [Киселев А.Н.] [08.10.2021] 
// Задача: [№ 19055], [#Статусы поручения экспедитору]
Функция СформироватьСоответствиеСтатусов() Экспорт
	
	СоответствиеСтатусов = Новый Соответствие();
	
	СоответствиеСтатусов.Вставить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Перечисление.СтатусыЗаданийНаПеревозку.Формируется"),Перечисления.РИНЭКО_СтатусыПорученияЭкспедитору.ВПроцессе);	
	СоответствиеСтатусов.Вставить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Перечисление.СтатусыЗаданийНаПеревозку.Отправлено"),Перечисления.РИНЭКО_СтатусыПорученияЭкспедитору.Отправлено);	
	СоответствиеСтатусов.Вставить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Перечисление.СтатусыЗаданийНаПеревозку.Закрыто"),Перечисления.РИНЭКО_СтатусыПорученияЭкспедитору.Получено);	
	Возврат СоответствиеСтатусов;
	
КонецФункции
